src/InformationRegisters/НастройкиПравДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПравДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНаследованияПравДоступаИерархическихСправочников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаследованияПравДоступаИерархическихСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбластьДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиДанныхОбъектовДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НазначениеВидовОбъектовДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>НазначениеВидовОбъектовДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПравДоступаПользователей/Ext/RecordSetModule.bsl
Перем мИнтерактивнаяЗапись Экспорт;
Перем мОткликИнтерактивнойЗаписи Экспорт;

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.ВидОбъектаДоступа) Тогда
			ЗаписьНабора.ВидОбъектаДоступа = НастройкаПравДоступа.ПолучитьВидОбъектаДоступа(ЗаписьНабора.ОбъектДоступа);
		КонецЕсли; 
	КонецЦикла; 
	
	Если мИнтерактивнаяЗапись = Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВнешнийИсточник.ВидОбъектаДоступа КАК ВидОбъектаДоступа,
		|	ВнешнийИсточник.Пользователь КАК ГруппаПользователей
		|ПОМЕСТИТЬ
		|	ВременнаяТаблица
		|ИЗ
		|	&ВнешнийИсточник КАК ВнешнийИсточник
		|ГДЕ
		|	ВнешнийИсточник.ОбъектДоступа = ВнешнийИсточник.ВладелецПравДоступа
		|	И ВнешнийИсточник.Пользователь <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
		|";
		
		Запрос.УстановитьПараметр("ВнешнийИсточник", ЭтотОбъект.Выгрузить());
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Представление(ТаблицаНабора.ВидОбъектаДоступа) КАК ВидОбъектаДоступа,
		|	Представление(ТаблицаНабора.ГруппаПользователей) КАК ГруппаПользователей,
		|	НазначениеВидовОбъектовДоступа.ГруппаПользователей
		|ИЗ
		|	ВременнаяТаблица КАК ТаблицаНабора
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрСведений.НазначениеВидовОбъектовДоступа КАК НазначениеВидовОбъектовДоступа
		|		ПО НазначениеВидовОбъектовДоступа.ГруппаПользователей = ТаблицаНабора.ГруппаПользователей
		|		 И НазначениеВидовОбъектовДоступа.ВидОбъектаДоступа = ТаблицаНабора.ВидОбъектаДоступа
		|ГДЕ
		|	НазначениеВидовОбъектовДоступа.ГруппаПользователей ЕСТЬ NULL
		|УПОРЯДОЧИТЬ ПО ТаблицаНабора.ГруппаПользователей
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			мОткликИнтерактивнойЗаписи = "Обнаружено несоответствие настроек!
							  |Для некоторых групп пользователей, используемых в текущих настройках ограничения прав, выключено использование ограничений по видам объектов доступа.
							  |Такие текущие настройки доступа не имеют смысла, потому что разрешения на указанные объекты такие группы пользователей все равно не получат.
							  |Возможно, следует скорректировать использование видов объектов доступа в форме группы пользователей.
							  |
							  |Следует проверить следующие группы пользователей:";
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				мОткликИнтерактивнойЗаписи = мОткликИнтерактивнойЗаписи + символы.ПС + " - " + Выборка.ГруппаПользователей + " (" + Выборка.ВидОбъектаДоступа + ")";
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
